package com.daffy3.ch05;

public class Intro {
    // 08. 자로형(data type) - 문자는 프로그램에서 어떻게 표현하여 사용하나요?

    // - 문자도 정수료 표현합니다.
    // - 어떤 문자를 컴퓨터 내부에서 표현하기 위해 특정 정수 값을 정의
    // - A는 65
    // - 문자세트: 각 문자를 얼마로 표현할 것인지 코드 값을 모아둔 것을 문자세트(Charater Set)이라고 한다.

    // 자바에서는 문자가 어떻게 표현되나요?
    // - 자바는 문자를 나타내기 위해 전세계 표준인 UNICODE를 사용
    // - UTF-16 인코딩을 사용 (모든 문자를 2바이트로 표시)

    // 문자형 변수 선언과 사용하기
    // - 문자를 위한 데이터 타입 char ch = 'A';
    // - 내부적으로 숫자로 표현되므로 숫자를 넣어도 문자가 출력될 수 있다.
    // - 문자를 표현할 때는 작은 따옴표 '' 를 사용하고, 묹자열을 표현할 경우에는 "" 큰 따옴표를 사용한다.
    // - '' 2바이트 문자를 표현
}
