package com.daffy3.ch08;

public class Intro {
    // 11. 자바의 연산자들 (대입, 부호, 산술, 복합대입, 증감연산자)

    // 항과 연산자
    // - 항(operand): 연산에 사용되는 값
    // - 연산자(operator): 항을 이용하여 연산하는 기호

    // 대입연산자
    // - 변수에 다른 변수나 값을 대입하는 연산자
    // - 이항 연산자 중 우선 순위가 가장 낮은 연산자들
    // - 왼쪽 변수 = 오른쪽 변수

    // 부호연산자
    // - 단항 연산자
    // - 변수의 부호를 유지하거나 바꿈
    // - 실제 변수의 부호가 변하려면 대입 연산자를 사용해야한다.

    // 산술연산자
    // 사칙연산
    // + : 두 항을 더합니다.
    // - : 앞에 있는 항에서 뒤에 있는 항을 뺍니다.
    // * : 두 항을 곱합니다.
    // / : 앞에 있는 항에서 뒤에 있는 항을 나누어 몫을 구합니다.
    // & : 앞에 있는 항에서 뒤에 있는 항을 나누어 나머지를 구합니다.
    // 나머지 구하는 연산자, 숫자 n의 나머지 범위는 0 ~ n-1

    // 복합 대입연산자
    // += : 두 항의 값을 더해서 왼쪽 항에 대입한다.
    // -+ : 왼쪽 항에서 오른쪽 항을 빼서 그 값을 왼쪽 항에 대입한다.
    // *= : 두 항의 값을 곱하여 왼쪽 항에 대입한다.
    // /= : 왼쪽 항을 오른쪽 항으로 나누어 그 몫을 왼쪽 항에 대입한다.
    // %= : 왼쪽 항을 오른쪽 항으로 나누어 그 나머지를 왼쪽 항에 대입한다.

    // 증가, 감소 연산자
    // - 단항 연산자
    // - 변수의 값을 1 더하거나 1 뺄 때 사용
    // - 연산자가 항의 앞에 있는가 뒤에 있는가에 따라 연산 시점과 결과가 달라짐
    // - 문장의 끝 즉, 세미콜론(;)을 기준으로 연산 시점을 생각해야한다.

}
