package ch03;

public class Intro {
    // 03. 배열(Array) 구현하기
    // Array의 특징
    // - 동일한 데이터 타입을 순서에 따라 관리하는 자료구조
    // - 정해진 크기가 있다.
    // - 요소의 추가와 제거시 다른 요소들의 이동이 필요하다.
    // - 배열의 i번째 요소를 찾는 인덱스 연산이 빠름
    // - JDK 클래스: ArrayList, Vector

    // 연결리스트(Linked List)의 특징
    // - 동일한 데이터 타입을 순서에 따라 관리하는 자료구조
    // - 자료를 저장하는 노드에는 자료와 다음 요소를 가리키는 링크(포인터)가 있다.
    // - 자료가 추가될 때, 노드 만큼의 메모리를 할당 받고 이전 노드의 링크로 연결한다. (정해진 크기가 없다.)
    // - 연결리스트의 i번째 요소를 찾는데 걸리는 시간은 요소의 개수와 비례한다.
    // - JDK 클래스: LinkedList
}
