package ch01;

public class Intro {
    // 01. 객체(Object)
    // - 의사나 행위가 미치는 대상(사전적 의미)
    // - 구체적, 추상적 데이터의 단위(학생, 회원, 생산, 주문, 배송)

    // 객체지향 프로그램과 절차지향 프로그램
    // 절차지향 프로그램: 시간의 흐름에 따라서 프로그램을 진행. 대표적인 예로 C언어가 있다.
    // 객체지향 프로그램은 객체를 정의하고, 각 객체가 제공하는 기능들을 구현하고, 각 객체가 제공하는 기능들 간의 소통(메시지 전달)을 통하여 객체간의 협력을 구현

    // ====================================================================================================

    // 02. 생활 속에서 객체를 찾아 클래스로 구현해보기
    // 객체를 찾아보자.
    // - 온라인 쇼핑몰에 회원 로그인을 하고, 여러 판매자가 판매하고 있는 제품 중 하나를 골라 주문을 한다. --> 회원, 판매자, 제품, 주문 등이 객체가 될 수 있다.
    // - 아침에 회사에 가는 길에 별다방 커피숍에 들려 아이스 카페라떼를 주문했다. --> '나'라는 사람, 회사, 커피숍, 음료, 바리스타 등이 객체가 될 수 있다.
    // - 성적확인을 위해 학사관리시스템에 로그인 하여 수강한 과목들의 성적을 확인했다. --> 학생, 교수님, 과목, 성적통계자료 등이 객체가 될 수 있다.

    // 클래스는 객체의 청사진(Blue Print)이다.
    // 객체의 속성은 클래스의 멤버변수(Member Variable)로 선언한다.
    // 클래스 이름의 시작은 대문자로 시작한다.
    // 클래스는 추상화 작업이다.

    // 객체지향 프로그램을 할 때는
    // - 객체를 정의하고,
    // - 각 객체의 속성을 멤버변수로 역할을 메서드로 구현하고
    // - 각 객체간의 협력을 구현한다.
}
