package com.daffy3.ch01;

public class Intro {
    // 01. 자바 프로그래밍 시작하기
    // 프로그래밍이란?
    // - 프로그래밍: 컴퓨터가 일을 수행하도록 프로그래밍 언어로 명령어 집합(프로그램)을 만드는 일
    // - 컴파일: 프로그래밍 언어를 컴퓨터가 실행 가능한 기계어로 만드는 일
    // - 컴파일러: 기계어로 바꾸어주는 프로그램(ex-자바컴파일러)

    // 패키지의 이름은 소문자로 작성한다.
    // 패키지의 이름을 정할 때, com.회사이름.프로젝트 순으로 작성한다.
    // 클래스의 이름은 대문자로 시작한다.

    public static void main(String[] args) {
        System.out.println("Hello, Java!!");
    }

    // 04. 컴퓨터에서 자료표현하기
    // 0과 1로만 데이터를 저장
    // bit(비트): 컴퓨터가 표현하는 데이터의 최소 단위로 2진수 하나의 값을 저장할 수 있는 메모리의 크기
    // byte(바이트): 1byte = 8bit

    // 비트로 나타낼 수 있는 수의 범위는?
    // 한 개의 비트로 나타낼 수 있는 수: 0과 1 (2개)
    // 두 개의 비트로 나타낼 수 있는 수: 00, 01, 10, 11 (4개)
}
