package com.daffy3.ch03;

public class Intro {
    // 06. 자료형(Data Type) - 정수는 어떻게 표현하나요?

    // 변수와 메모리
    // 변수를 선언하면 해당되는 자료형의 크기만큼 메모리가 할당
    // 변수는 할당된 메모리를 가리키는 이름
    int level = 19; // 4바이트 정수형 메모리가 level 이라는 이름으로 할당

    // ====================================================================================================

    // 문자형 2바이트 = char

    // 논리형 1바이트 = boolean

    // 정수형 1바이트 = byte
    // 정수형 2바이트 = short
    // 정수형 4바이트 = int
    // 정수형 8바이트 = long

    // 실수형 4바이트 = float
    // 실수형 8바이트 = double
}
